Pandas : It is a library used for data manipulation , analysis and pre processing

Functionalities:
Dataframe
Data Manipulation
Data Cleaning
Data Analysis
Data Input /Output


Structure:

1. Series : is a 1D labeled array that can hold any data type
2. Dataframe:- is a 2D labeled array that can hold different data type

In [5]:
import pandas as pd

In [6]:
s=pd.Series([10,20,30])
print(s[1])

20

In [7]:
data={'Name':['Randhir','Abhi','Harsh','Chetna','Jatin','Harish'],'Age':[20,21,20,13,28,30]}
df=pd.DataFrame(data)
df

      Name  Age
0  Randhir   20
1     Abhi   21
2    Harsh   20
3   Chetna   13
4    Jatin   28
5   Harish   30

In [8]:
age=df['Age']
age

0    20
1    21
2    20
3    13
4    28
5    30
Name: Age, dtype: int64

In [9]:
df.loc[0]

Name    Randhir
Age          20
Name: 0, dtype: object

In [10]:
df.loc[0:1]

      Name  Age
0  Randhir   20
1     Abhi   21

In [11]:
df['Age'].loc[0:2]

0    20
1    21
2    20
Name: Age, dtype: int64

In [12]:
s=df.sort_values(by='Name')
s

      Name  Age
1     Abhi   21
3   Chetna   13
5   Harish   30
2    Harsh   20
4    Jatin   28
0  Randhir   20

In [13]:
summary=df.describe()
summary

             Age
count   6.000000
mean   22.000000
std     6.164414
min    13.000000
25%    20.000000
50%    20.500000
75%    26.250000
max    30.000000

In [14]:
gd=df.groupby('Name').mean()
gd

          Age
Name
Abhi     21.0
Chetna   13.0
Harish   30.0
Harsh    20.0
Jatin    28.0
Randhir  20.0

In [15]:
ds=pd.read_csv('MovieDataset.csv')
ds.head()

,Unnamed: 0,id,original_title,overview,popularity,release_date,title,vote_average,vote_count
0,0,238,The Godfather,"Spanning the years 1945 to 1955, a chronicle o...",111.740,1972-03-14,The Godfather,8.7,18211
1,1,278,The Shawshank Redemption,Framed in the 1940s for the double murder of h...,84.855,1994-09-23,The Shawshank Redemption,8.7,24100
2,2,240,The Godfather Part II,In the continuing saga of the Corleone crime f...,69.517,1974-12-20,The Godfather Part II,8.6,10986
3,3,19404,दिलवाले दुल्हनिया ले जायेंगे,"Raj is a rich, carefree, happy-go-lucky second...",34.942,1995-10-20,Dilwale Dulhania Le Jayenge,8.6,4165
4,4,424,Schindler's List,The true story of how businessman Oskar Schind...,43.833,1993-12-15,Schindler's List,8.6,14242

In [16]:
ds.tail()

,Unnamed: 0,id,original_title,overview,popularity,release_date,title,vote_average,vote_count
9975,9975,4954,Drop Zone,"A daring prison break from an airliner at 30,0...",15.269,1994-12-08,Drop Zone,5.6,342
9976,9976,559401,Sibyl,"Sibyl, a jaded psychotherapist, returns to her...",13.304,2019-05-24,Sibyl,5.6,325
9977,9977,346910,The Predator,When a young boy accidentally triggers the uni...,53.573,2018-09-05,The Predator,5.6,4192
9978,9978,205584,Gods of Egypt,A common thief joins a mythical god on a quest...,51.365,2016-02-25,Gods of Egypt,5.6,3762
9979,9979,72890,Girl Most Likely,A failed New York playwright stages a suicide ...,8.746,2012-09-07,Girl Most Likely,5.6,228

In [17]:
marks=[90,98,78,82,76]
sub=['eng','hin','math','sci','bio']
pd.Series(sub,marks)

90     eng
98     hin
78    math
82     sci
76     bio
dtype: object

Merging DataFrames

In [18]:
df1=pd.DataFrame({'id':[1,2,3],'Name':['a','b','c']})
df2=pd.DataFrame({'id':[2,3,4],'Age':[20,21,22]})

In [19]:
df1

   id Name
0   1    a
1   2    b
2   3    c

In [20]:
df2

   id  Age
0   2   20
1   3   21
2   4   22

In [21]:
mer_df=pd.merge(df1,df2)
mer_df

   id Name  Age
0   2    b   20
1   3    c   21

In [24]:
mer_df=pd.concat([df1,df2],ignore_index=True)
mer_df

   id Name   Age
0   1    a   NaN
1   2    b   NaN
2   3    c   NaN
3   2  NaN  20.0
4   3  NaN  21.0
5   4  NaN  22.0